{"config": [{"config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 128, 128, 3], "strides": [1, 1], "name": "conv2d_1", "filters": 32, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_3", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_4", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_4", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_5", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_5", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_6", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_6", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_7", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_7", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "units": 256, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "leaky_re_lu_1", "alpha": 0.3333333432674408, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "units": 256, "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "leaky_re_lu_2", "alpha": 0.3333333432674408, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "units": 256, "kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "leaky_re_lu_3", "alpha": 0.3333333432674408, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"name": "dropout_2", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "units": 121, "kernel_regularizer": null, "name": "dense_4", "bias_regularizer": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}