{"config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "batch_input_shape": [null, 128, 128, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "dtype": "float32", "name": "conv2d_1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_3", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_4", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_5", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_5", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_6", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_6", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_7", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_7", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "bias_constraint": null, "units": 256, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "alpha": 0.3333333432674408, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "bias_constraint": null, "units": 256, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "alpha": 0.3333333432674408, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "bias_constraint": null, "units": 256, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "alpha": 0.3333333432674408, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "units": 121, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}